#Тема: Хеш-функції у Python
# -------------------------------------
# Завдання 1 — Хеш рядка
# -------------------------------------
# Напиши функцію, яка приймає рядок і повертає його хеш за допомогою hash().
# Додатково: перевір, чи однаковий хеш у двох однакових рядків і різний для різних рядків.

# Місце для твого коду:
def hash_string(s):
 return hash(s)
print(hash_string("apple"))
print(hash_string("banana"))
# Приклади виклику:
# print(hash_string("apple"))
# print(hash_string("banana"))


# -------------------------------------
# Завдання 2 — Хеш числа
# -------------------------------------
# Створи словник, де ключами будуть числа від 1 до 10,
# а значеннями — їхні хеші.
# Виведи словник на екран.

# Місце для твого коду:
number_hashes = {}
for i in range(1, 11):
    number_hashes[i] = hash(i)
print(number_hashes)


# -------------------------------------
# Завдання 3 — Перевірка унікальності
# -------------------------------------
# Є список рядків:
# words = ["apple", "banana", "apple", "orange", "banana"]
# Використай хеші, щоб визначити кількість унікальних елементів
# без використання set().

# Місце для твого коду:
words = ["apple", "banana", "apple", "orange", "banana"]
unique_hashes = []
for w in words:
    h = hash(w)
    if h not in unique_hashes:
        unique_hashes.append(h)
print("Кількість унікальних елементів:", len(unique_hashes))


# -------------------------------------
# Завдання 4 — Хеш словника
# -------------------------------------
# Створи словник, де ключем буде кортеж (ім’я, вік),
# а значенням — оцінка. Використай hash() для перевірки унікальності ключів.

# Місце для твого коду:
students_scores = {}
students_scores[("Ivan", 20)] = 90
students_scores[("Olga", 19)] = 100
students_scores[("Petro", 22)] = 85
print(students_scores)


# -------------------------------------
# Завдання 5 — Власна проста хеш-функція
# -------------------------------------
# Напиши просту хеш-функцію для рядка:
# 1) переведи всі символи в коди ASCII (ord())
# 2) підсумуй коди
# 3) візьми залишок від ділення на 10
# Перевір на кількох словах і подумай про можливі колізії.

# Місце для твого коду:
def simple_hash(s):
    total = 0
    for ch in s:
        total += ord(ch)
    return total % 10


print(simple_hash("apple"))
print(simple_hash("banana"))
print(simple_hash("orange"))
# Приклади виклику:
# print(simple_hash("apple"))
# print(simple_hash("banana"))
# print(simple_hash("orange"))
